let text = "[ti&#58;模特&#32;&#40;Live&#41;]&#10;[ar&#58;李荣浩/毛不易/马伯骞]&#10;[al&#58;明日之子&#32;第15期]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;01]模特&#32;&#40;Live&#41;&#32;&#45;&#32;李荣浩/毛不易/马伯骞&#10;[00&#58;00&#46;02]词：周耀辉/马伯骞&#10;[00&#58;00&#46;03]曲：李荣浩/马伯骞&#10;[00&#58;00&#46;04]编曲：Nick&#32;&#38;Mai&#10;[00&#58;00&#46;05]音乐总监：谭伊哲&#10;[00&#58;00&#46;06]乐队：TYZ乐队&#10;[00&#58;00&#46;07]乐队队长兼吉他手：黄竣琮&#10;[00&#58;00&#46;08]键盘1：韩韵&#10;[00&#58;00&#46;09]键盘2：杨猛&#10;[00&#58;00&#46;10]鼓手：胡宇飞&#10;[00&#58;00&#46;11]吉他2：Andrew&#32;Moore（加拿大）&#10;[00&#58;00&#46;12]贝斯：&#32;Ryan&#32;Bradetich（美国）&#10;[00&#58;00&#46;13]和声：梁古驰/王思思/刘芮嘉&#10;[00&#58;00&#46;14]打击乐：Gman&#10;[00&#58;00&#46;15]电脑工程：郭丁尘&#10;[00&#58;00&#46;16]音乐统筹：吕易秋&#32;by&#32;T&#46;Y&#46;Z&#10;[00&#58;00&#46;17]&#10;[00&#58;13&#46;08]毛：&#10;[00&#58;13&#46;52]&#10;[00&#58;14&#46;93]穿华丽的服装&#10;[00&#58;16&#46;40]为原始的渴望而站着&#10;[00&#58;19&#46;43]&#10;[00&#58;22&#46;33]用完美的表情&#10;[00&#58;23&#46;73]为脆弱的城市而撑着&#10;[00&#58;27&#46;42]李：&#10;[00&#58;27&#46;94]&#10;[00&#58;29&#46;72]我冷漠的接受&#10;[00&#58;31&#46;13]你焦急的等待也困着&#10;[00&#58;34&#46;41]&#10;[00&#58;37&#46;02]像无数生存在橱窗里的模特&#10;[00&#58;41&#46;99]毛：&#10;[00&#58;42&#46;51]&#10;[00&#58;44&#46;77]除了灯以外&#32;我还能看见什么&#10;[00&#58;48&#46;27]除了光以外&#32;我还能要求什么&#10;[00&#58;51&#46;96]除了你以外&#32;还能依赖哪一个&#10;[00&#58;57&#46;36]&#10;[00&#58;58&#46;09]李：&#10;[00&#58;58&#46;55]&#10;[00&#58;59&#46;32]在千里以外&#32;在呼喊的是什么&#10;[01&#58;02&#46;97]在百年以后&#32;想回忆的是什么&#10;[01&#58;06&#46;65]在离开以前&#32;能否再见那一刻&#10;[01&#58;11&#46;97]毛：&#10;[01&#58;12&#46;33]记得&#32;你的眼睛将会亮着&#10;[01&#58;17&#46;80]我的手臂将会挥着&#10;[01&#58;21&#46;39]谁说世界早已没有选择&#10;[01&#58;26&#46;09]&#10;[01&#58;27&#46;14]李：&#10;[01&#58;27&#46;90]趁着&#32;我会喜怒你会哀乐&#10;[01&#58;32&#46;46]唱几分钟情歌&#10;[01&#58;34&#46;82]合：&#10;[01&#58;35&#46;17]没什么&#32;至少证明我们还活着&#10;[01&#58;40&#46;20]&#10;[01&#58;41&#46;81]记得&#32;你的眼睛将会亮着&#10;[01&#58;47&#46;08]李：&#10;[01&#58;47&#46;43]我的手臂将会挥着&#10;[01&#58;50&#46;70]合：&#10;[01&#58;51&#46;05]谁说世界&#32;早已没有选择&#10;[01&#58;55&#46;80]&#10;[01&#58;56&#46;31]毛：&#10;[01&#58;56&#46;81]&#10;[01&#58;57&#46;43]趁着&#32;我会喜怒你会哀乐&#10;[02&#58;01&#46;81]合：&#10;[02&#58;02&#46;14]唱几分钟情歌&#10;[02&#58;04&#46;19]&#10;[02&#58;04&#46;74]没什么&#32;至少证明我们还活着&#10;[02&#58;10&#46;52]&#10;[02&#58;26&#46;61]马：&#10;[02&#58;27&#46;05]&#10;[02&#58;28&#46;14]又是浓妆&#32;穿着爆款&#10;[02&#58;29&#46;82]夜场走一趟&#10;[02&#58;30&#46;99]&#10;[02&#58;31&#46;69]各处游荡&#32;工资掏完&#10;[02&#58;33&#46;45]昨晚早遗忘&#10;[02&#58;34&#46;74]&#10;[02&#58;35&#46;41]Answer&#32;me&#32;baby&#32;are&#32;you&#32;演技派&#10;[02&#58;37&#46;31]不是就不要一直耍无赖&#10;[02&#58;39&#46;04]Really&#32;wanna&#32;front&#32;and&#32;then&#32;start&#32;a&#32;fight&#10;[02&#58;40&#46;54]真实一点不要再去走那偶像派&#10;[02&#58;42&#46;65]踩入我的底线&#10;[02&#58;43&#46;63]&#10;[02&#58;44&#46;38]你仍然还继续开玩笑&#32;now&#32;wait&#10;[02&#58;46&#46;46]Im&#32;the&#32;only&#32;one&#32;in&#32;the&#32;crowd&#32;now&#32;wait&#10;[02&#58;48&#46;20]以为你是国际影星&#32;now&#32;wait&#10;[02&#58;50&#46;13]台下&#32;一人&#32;仰望&#32;looking&#32;at&#32;you&#10;[02&#58;52&#46;36]感情&#32;方面&#32;放下&#32;偶像&#32;包袱&#10;[02&#58;54&#46;77]Focus&#32;on&#32;back&#32;to&#32;reality&#10;[02&#58;55&#46;89]&#10;[02&#58;56&#46;39]Focus&#32;on&#32;sanity&#32;sanity&#10;[02&#58;58&#46;03]&#10;[03&#58;00&#46;12]李：&#10;[03&#58;00&#46;49]&#10;[03&#58;01&#46;07]穿华丽的服装&#10;[03&#58;02&#46;58]为原始的渴望而站着&#10;[03&#58;05&#46;57]&#10;[03&#58;08&#46;45]用完美的表情&#10;[03&#58;10&#46;11]为脆弱的城市而撑着&#10;[03&#58;13&#46;07]&#10;[03&#58;15&#46;83]我冷漠的接受&#10;[03&#58;17&#46;38]你焦急的等待也困着&#10;[03&#58;20&#46;42]&#10;[03&#58;23&#46;17]像无数生存在橱窗里的模特&#10;[03&#58;27&#46;83]&#10;[03&#58;28&#46;64]马：&#10;[03&#58;29&#46;21]&#10;[03&#58;30&#46;79]Rising&#32;action&#32;都没发生&#10;[03&#58;32&#46;49]这戏到了高潮&#10;[03&#58;33&#46;78]&#10;[03&#58;34&#46;53]Model不能一直高调&#10;[03&#58;36&#46;13]预料之中早就想到&#10;[03&#58;37&#46;68]&#10;[03&#58;38&#46;26]砸着手机跟我瞎闹&#10;[03&#58;39&#46;87]早已看穿你的那套&#10;[03&#58;41&#46;64]完全看淡&#32;好好寻找&#10;[03&#58;43&#46;70]能不能就好好谈个恋爱right&#32;now&#10;[03&#58;45&#46;53]You&#32;think&#32;you&#32;bad&#32;and&#32;boujie&#10;[03&#58;46&#46;71]&#10;[03&#58;47&#46;45]不承认就是不服气&#10;[03&#58;49&#46;03]幻想大女人背gucci&#10;[03&#58;50&#46;30]&#10;[03&#58;51&#46;11]不干正事还不努力&#10;[03&#58;52&#46;33]&#10;[03&#58;52&#46;90]刷存在感&#10;[03&#58;53&#46;81]吃青春饭&#10;[03&#58;54&#46;73]一去不返&#10;[03&#58;55&#46;70]反应过来&#10;[03&#58;56&#46;38]发现已经太晚&#10;[03&#58;57&#46;57]皱纹早在脸庞上面长满&#10;[03&#58;59&#46;45]李：&#10;[03&#58;59&#46;83]&#10;[04&#58;00&#46;37]除了灯以外&#10;[04&#58;01&#46;61]马：&#10;[04&#58;01&#46;94]以为自己维密模特&#10;[04&#58;03&#46;73]李：&#10;[04&#58;04&#46;07]除了光以外&#10;[04&#58;05&#46;12]马：&#10;[04&#58;05&#46;48]幻想一生多彩多乐&#10;[04&#58;07&#46;63]李：&#10;[04&#58;07&#46;98]除了你以外&#10;[04&#58;09&#46;09]马：&#10;[04&#58;09&#46;42]趁还年轻&#32;不要磨蹭&#10;[04&#58;11&#46;27]忽略美好结果重视艰辛过程&#10;[04&#58;14&#46;56]李：&#10;[04&#58;14&#46;92]在千里以外&#10;[04&#58;16&#46;45]马：&#10;[04&#58;16&#46;78]重场戏前眼泪都已流干&#10;[04&#58;18&#46;60]李：&#10;[04&#58;18&#46;94]在百年以后&#10;[04&#58;20&#46;11]马：&#10;[04&#58;20&#46;60]笑容已不像从前般灿烂&#10;[04&#58;22&#46;21]李：&#10;[04&#58;22&#46;54]在离开以前&#10;[04&#58;23&#46;87]马：&#10;[04&#58;24&#46;19]Don&#39;t&#32;be&#32;stupid&#32;baby&#10;[04&#58;25&#46;68]&#10;[04&#58;26&#46;28]You&#39;ve&#32;been&#32;&#32;foolish&#32;lately&#32;maybe&#10;[04&#58;29&#46;15]李：&#10;[04&#58;29&#46;50]记得&#32;你的眼睛将会亮着&#10;[04&#58;33&#46;46]我的手臂将会挥着&#10;[04&#58;36&#46;99]谁说世界早已没有选择&#10;[04&#58;41&#46;46]&#10;[04&#58;43&#46;67]趁着&#32;我会喜怒你会哀乐&#10;[04&#58;48&#46;19]唱几分钟情歌&#10;[04&#58;50&#46;44]&#10;[04&#58;50&#46;98]没什么&#32;至少证明我们还活着&#10;[04&#58;57&#46;07]合：&#10;[04&#58;57&#46;64]记得你的眼睛将会亮着&#10;[05&#58;02&#46;50]&#10;[05&#58;03&#46;00]我的手臂将会挥着&#10;[05&#58;06&#46;59]谁说世界早已没有选择&#10;[05&#58;11&#46;07]&#10;[05&#58;13&#46;27]趁着&#32;我会喜怒你会哀乐&#10;[05&#58;17&#46;64]唱几分钟情歌&#10;[05&#58;19&#46;80]&#10;[05&#58;20&#46;33]没什么&#32;至少证明我们还活着"

class LyricsPlayer {
    constructor(el) {
        this.$el = el
        this.$el.innerHTML = '<div class="player-lyrics-lines"></div>'
        this.$lines = this.$el.querySelector('.player-lyrics-lines')
        this.text = ''
        this.index = 0
        this.elapsed = 0
        this.lyrics = []
        this.reset(this.text)
    }

    start() {
        this.intervalId = setInterval(this.update.bind(this), 1000)
    }

    pause() {
        clearInterval(this.intervalId)
    }

    update() {
        this.elapsed += 1
        if (this.index === this.lyrics.length - 1) return this.reset()
        for (let i = this.index + 1; i < this.lyrics.length; i++) {
            let seconds = this.getSeconds(this.lyrics[i])
            if (this.elapsed === seconds && (!this.lyrics[i + 1] || this.elapsed < this.getSeconds(this.lyrics[i + 1]))) {
                this.$lines.children[this.index].classList.remove('active')
                this.$lines.children[i].classList.add('active')
                this.index = i
                break
            }
        }
        if (this.index > 2) {
            let y = -(this.index - 2) * this.LINE_HEIGHT
            this.$lines.style.transform = `translateY(${y}px)`
        }
    }

    render() {
        let html = this.lyrics.map(line =>`
            <div class="player-lyrics-line">${line.slice(10)}</div>
        `).join('')
        this.$lines.innerHTML = html
    }

    reset(text) {
        this.pause()
        this.index = 0
        this.elapsed = 0
        if (text) {
            this.text = this.formatText(text) || ''
            this.lyrics = this.text.match(/^\[\d{2}:\d{2}.\d{2}\](.+)$/gm) || []
            if (this.lyrics.length) {
                this.render()
                this.$lines.children[this.index].classList.add('active')
            }
        }
    }

    restart() {
        this.reset()
        this.start()
    }

    getSeconds(line) {
        return +line.replace(/^\[(\d{2}):(\d{2}).*/, (match, p1, p2) => 60 * (+p1) + (+p2))
    }

    formatText(text) {
        let div = document.createElement('div')
        div.innerHTML = text
        return div.innerText
    }

}

LyricsPlayer.prototype.LINE_HEIGHT = 42